# как создать словарь

# 1. Словарный литерал (константа)
d1 = {
    'a': 1,
    'b': 2
}
print("d1=", d1)

# 2. Создать пустой словарь и наполнить его значениями
d2 = {}
d2['a'] = 1
d2['b'] = 2
print("d2=", d2)

# 3. Из списка кортежей
d3 = dict([('a', 1), ('b', 2)])
print("d3=", d3)

# 4. С помощью функции dict и передачи ключевых аргументов
d4 = dict(a=1, b=2)
print("d4=", d4)


# 5. Dictionary comprehension
tuple_list = [('a', 1), ('b', 2)]
d5 = {k: v + 1 for k, v in tuple_list}
print("d5=", d5)
