# 1). Создайте пустой список data_analyst_soft_skills и добавьте в него следующие
# элементы с помощью метода append:
# "здравый смысл", "внимательность к деталям", "упорство", "трудолюбие".
#
# 2). Распечатайте список на экране.
# После этого добавьте в начало списка:
# "навыки общения", "любопытство"
#
# 3). Отобразите на экране с помощью среза элементы списка: "упорство", "трудолюбие"
# 4). Отобразите на экране первое и последнее слово получившегося списка

# Зад
#
#
#
#
#


user_events = [
    'main_screen_displayed',
    'open_button_cliked',
    'document_opened',
    'edit_document',
    'edit_document',
    'edit_document',
    'edit_document',
    'document_saved',
    'app_normally_closed'
]

# Дан список событий, полученный из логов приложения (как пример, Microsoft Word)

# Ответить на следующие вопросы:
# выведите на экран сообщение, если пользователь открыл документ
# тоже самое, но для сохранения документа
# было ли приложение закрыто без ошибок после сохранения документа?
# был ли отображен главный экран (main screen) в начале работы приложения?
# редактировал ли пользователь документ?
# lists, if, for in range, for, print
