# 1. Напишете программу, выводящую в терминал строку
# I want to be data analyst
# Использовать: print


# 2. Напишите программу, которая вводит ваше имя с клавиатуры, например, Иван.
# После завершения ввода программа выведет "Иван was hired as data analyst!"
# В терминале:
# Введите имя: Иван
# Иван принят на должность аналитика данных!
# Использовать: input, print, string interpolation

# 3. Напишите программу, которая вводит с клавиатуры ваше имя и город.
# После завершения ввода программа должна вывести "Привет, <Имя>, как погода в <Город>?"
