# Задача 1
# Программа вводит число часов и минут с клавиатуры в 24-часовом формате.
# Напишите программу, которая
# 1). Проверяет, что числа корректные, т.е. больше нуля и меньше 23 для часов и от 0 до 59 для минут
# Если число неверное, к примеру 26, то нужно напечатать "Неправильное число часов: 26".
# Аналогично для минут
# 2). Программы выводит число часов и минут в 12-часовом формате: 08:34 AM, 03:16 PM
# Указываем время суток AM/PM, т.е. если время с 13 до 24 часов, то PM, если с 0 до 12 - AM.
# Например:
# Введите число часов: 23
# Введите число минут: 12
# Время: 11:12 PM
# Темы: условия (if, else), input, print, интерполяция строк
