# Спринт 8. Проект "Телефонный справочник"

# Описание проекта
Необходимо написать программу - консольный телефонный справочник.
Данные хранятся на диске в JSON-файле, т.е. при повторном старте
программы данные сохраняются.
Справочник должен хранить имя и телефон.
Считаем, что имена уникальные, дублирование не допускается. 
Выводим ошибку при полном дублировании имени контакта и телефона.

При запуске программы каждый раз вводится команда, состоящая из 2, 3 слов, 
разделенных пробелами. Команда выполнилась, дальше пользователь вводит
следующую и так до тех пор, пока он/она не напишет exit.
Если команда неизвестна или команде недостает аргументов - выводит дружественное
сообщение об ошибке (используйте исключения raise Exception и их обработку).

Сделайте программу дружественной к пользователю: нельзя выводить необработанное исключение, в крайнем случае выводите "неизвестная ошибка".

Если аргумент команды (например, имя человека) допускает пробелы, то он вводится в кавычках. Если нет - без кавычек, не заставляйте пользователя везде писать кавычки.

Команды нужно вводить через функцию **input**.

Примеры команд:
Добавить пользователя 
add ivan_ivanov 123-1345-2323-2
add "Иванов Иван Иванович" "+9 1223 222 22 22"

Удалить пользователя
delete ivan_ivanov
delete "Иван Сергеевич"

Показать все контакты:
list

Показать контакт (телефон)
list "Иван Сергеевич"

Найти контакт по телефону или его части:
find +1 123 233 2323

Смержить контакты. 
Если есть дубликаты - выводим ошибку. 
Для продвинутых: телефоны дубликатов в объединенной базе данных пусть идут через запятую. Разумеется, предусмотреть обработку ошибок.
Пример команды
merge another_file.json

При поиске контакта по телефону не усложняем сильно, ищем подстроку: к примеру, если ввели
123, то должны найтись телефоны с 123 внутри.

# Рекомендации:
 - создайте отдельную папку для проекта, не мешайте его с другими задачами и проектами
 - используйте модули, не пишите все в одном файле.
 - используйте процедуры и функции в Python
 - подумайте о разделении концепций: хранение в одном модуле, обработка команд в другом.
 - если не разберетесь с модулями, пишите все в одной файле, это не проблема. Потом разобьете на модули, когда разберетесь с темой. Заодно, в таком случае, увидите как удобно их использовать.
 - если не сможете создать проект в отдельной папке, то либо пишите все в одном модуле, либо поставьте PyCharm и посмотрите в видео по ссылке ниже как создавать проекты.

Желательно предусмотреть:
 - Изначально в задаче предлагается достаточно простой поиск по телефону.
 Подумайте, как можно менять алгоритмы поиска, не меняя остальную программу.
 Подсказка: как вариант, передавать функцию в функцию.

Рекомендация: пишите юнит-тесты

Для продвинутых:
 - Как отделить логику команд, ввода и вывода данных от хранения.
Иными словами, как сделать так, чтобы можно было заменить хранилище 
(c файлов на SQL-базу данных, например)
и не изменить другие части программы.


# Теоретические материалы:
Про модули, пакеты, установку пакетов и модульное тестирование смотрите следующее видео, там основы. Лучше посмотреть все до проекта аналитика. Про модули и пакеты начинается с 02:14:16.
 - https://vkvideo.ru/video-228808006_456239019

Про запись данных в JSON-файл смотрите видео по ссылке (тот же самый курс), но с 03:02:28. Таймкоды есть в описании к видео. Можно также загуглить или обратиться к нейросети за кусочком кода.
 - https://vkvideo.ru/video-228808006_456239019


# Если что-то не понятно
В любом ТЗ есть пробелы. Вы придете на работу аналитиком и вам будут давать ТЗ значительно менее подробные. Не спешите бежать к менеджеру/ментору. Ваша задача - заполнить пробелы в ТЗ самостоятельно, если они конечно есть. Иными словами, добавьте в модель нужные параметры, если считаете нужным.
Это - проект, проявите творческий подход, делайте в любом виде, который хотите. Главное - ответить на вопрос проекта.

# Если не понятно как создавать модули и проекты.
Делайте в одной файле, тема выходит за пределы базового курса, но мы разберем ее более подробно в продвинутом.

# Если не понятен JSON
Это - просто словарь, записанный в файл. Если категорически не понимаете, то записывайте данные в файл в формате "ключ-значение", потом этот файл надо будет прочитать и написать функцию, которая парсит данные. Лучше написать "заглушку", чем ничего не сделать.

# Главное
Запомните принцип - лучше сделать и показать не совсем то, чем не сделать вообще или сказать "я не знаю".  Ответ "это мы не проходили, это нам не задавали" или "я не знаю" вызовет категорическое отторжение в реальной работе. Если сделали неправильно - мы сделаем правильно на следующей итерации. Вы обязаны показать хоть что-то через неделю. 

# Если совсем застряли
Прежде чем написать мне, остановитесь, подумайте. Стоит ли это делать, или можно разобраться самому. Если решили написать - пишите. Но помните - за вас я решить не могу, учиться нужно вам. 
Это - первая более/менее приближенная к реальности проблема: есть постановка задачи, есть цель, средства ее достижения - на ваше усмотрение. До этого мы решали просто задачки, теперь - проекты.

# Шаблон кода для старта
Можете написать свой код, если желаете.

```python

def list_contacts():
    pass


def add_new():
    pass


def remove():
    pass


cmd_name: str = ''
while cmd_name != "exit":
    cmd_name = input("Enter command: ")
    command_name, command_param = parse_command(cmd_name)
    if command_name == "list":
        pass # выводим контакты
    elif command_name == "new":
        pass # добавляем новый
    else:
        print("Unknown commad")
    print(
        f"Command name = {command_name}, command_param = {command_param}")

```



