# Задача 1
# Напишите программу, которая вводит с клавиатуры два целых числа и печатает на экран
# сумму этих чисел
# Использовать: input, int(строка), print

# Задача 2
# Напишите программу, которая вводит с клавиатуры имя, фамилию, отчество человека.
# На выходе печатает фамилию, имя, отчество единой строкой
# Например:
# Введите имя: Лев
# Введите отчество: Николаевич
# Введите фамилию: Толстой
# ФИО: Толстой Лев Николаевич
# Использовать: input, конкатенация строк, print

# Задача 3
# Напишите программу, которая вводит сумму покупки в долларах и обменный курс доллара к рублю.
# Выводит на экран сумму покупки в рублях.
# Не забываем, что курс доллара может быть дробным (95.1 руб./долл.)
# Использовать: input, print, конвертация типов.

# Задача 4
# Напишите программу, которая вводит скорость пользователя в километрах в час,
# а возвращает скорость в метрах в секунду.
# Подсказка: в километре одна тысяча метров, а в часе - 60 минут и 60 секанд в каждой минуте
