# Задача 1
# Напишите программу, которая вводит скорость пользователя в километрах в час,
# а возвращает скорость в метрах в секунду.
# Подсказка: в километре одна тысяча метров, а в часе - 60 минут и 60 секунд в каждой минуте

# Задача 2
# Напишите программу, которая вводит число часов с клавиатуры в формате 24 часов (к пример, 23 часа)
# На выходе программа печатает число часов в 12-часовом формате.
# Например:
# Введите число часов: 21
# Сейчас 9 часов
# Подсказка: поделите с остатком на 12.
